NghiaNgo0409/STM32LAB2/SOURCE_CODE/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ENM_0_Pin GPIO_PIN_2
#define ENM_0_GPIO_Port GPIOA
#define ENM_1_Pin GPIO_PIN_3
#define ENM_1_GPIO_Port GPIOA
#define LED_DOT_Pin GPIO_PIN_4
#define LED_DOT_GPIO_Port GPIOA
#define LED_RED_Pin GPIO_PIN_5
#define LED_RED_GPIO_Port GPIOA
#define BUTTON_0_Pin GPIO_PIN_6
#define BUTTON_0_GPIO_Port GPIOA
#define BUTTON_1_Pin GPIO_PIN_7
#define BUTTON_1_GPIO_Port GPIOA
#define a_Pin GPIO_PIN_0
#define a_GPIO_Port GPIOB
#define b_Pin GPIO_PIN_1
#define b_GPIO_Port GPIOB
#define c_Pin GPIO_PIN_2
#define c_GPIO_Port GPIOB
#define ROW_2_Pin GPIO_PIN_10
#define ROW_2_GPIO_Port GPIOB
#define ROW_3_Pin GPIO_PIN_11
#define ROW_3_GPIO_Port GPIOB
#define ROW_4_Pin GPIO_PIN_12
#define ROW_4_GPIO_Port GPIOB
#define ROW_5_Pin GPIO_PIN_13
#define ROW_5_GPIO_Port GPIOB
#define ROW_6_Pin GPIO_PIN_14
#define ROW_6_GPIO_Port GPIOB
#define ROW_7_Pin GPIO_PIN_15
#define ROW_7_GPIO_Port GPIOB
#define BUTTON_2_Pin GPIO_PIN_8
#define BUTTON_2_GPIO_Port GPIOA
#define BUTTON_3_Pin GPIO_PIN_9
#define BUTTON_3_GPIO_Port GPIOA
#define ENM_2_Pin GPIO_PIN_10
#define ENM_2_GPIO_Port GPIOA
#define ENM_3_Pin GPIO_PIN_11
#define ENM_3_GPIO_Port GPIOA
#define ENM_4_Pin GPIO_PIN_12
#define ENM_4_GPIO_Port GPIOA
#define ENM_5_Pin GPIO_PIN_13
#define ENM_5_GPIO_Port GPIOA
#define ENM_6_Pin GPIO_PIN_14
#define ENM_6_GPIO_Port GPIOA
#define ENM_7_Pin GPIO_PIN_15
#define ENM_7_GPIO_Port GPIOA
#define d_Pin GPIO_PIN_3
#define d_GPIO_Port GPIOB
#define e_Pin GPIO_PIN_4
#define e_GPIO_Port GPIOB
#define f_Pin GPIO_PIN_5
#define f_GPIO_Port GPIOB
#define g_Pin GPIO_PIN_6
#define g_GPIO_Port GPIOB
#define ROW_0_Pin GPIO_PIN_8
#define ROW_0_GPIO_Port GPIOB
#define ROW_1_Pin GPIO_PIN_9
#define ROW_1_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
